package com.sitronics.dataprovider;

import java.util.ArrayList;

import com.sitronics.data.Solution;
import com.sitronics.data.Event;

@SuppressWarnings("serial")
final public class SolutionProvider
{
	public static ArrayList<Solution> getSolutions()
	{
		return new ArrayList<Solution>(){{
				add(new Solution("Система анализа статистических данных","Информационно-аналитическая платформа  решает задачи эффективного хранения  и обработки неограниченных объёмов неструктурированных или слабосвязанных данных.  Демонстарция работы через ползовательский интерфейс BI-приложения  от QlickviewКрупное спортивное событие - это всегда огромный поток информации, накапливающихся в сотнях различных информационных систем и приложений. Современные решения анализа больших объемов данных (Big Data) позволяют собирать структурированную и неструктурированную информацию с различных источников, анализировать ее и представлять удобном и наглядном виде. Например, консолидировать информацию по результатам всех футбольних матчей чемпионатов мира годы и  в считанные секунды получить ответ на самый необычный аналитический запрос в графическом виде. Так же технологии Big Data внедряются в крупнейших банках, телеком компаниях для анализа поведения потребителей, формирования эксклюзивных продуктов и услуг.","dfgdfg","44fgdfgdfg",""));
				add(new Solution("Универсальная карта участника","Решение представляет собой семейство продуктов, обеспечивающих тарификацию различных видов услуг и биллинг, управление услугами абонентов бонусными кампаниями и т.д. Решение включает в себя более 20 систем с широчайшей функциональностью. Например, интегрировать на единой карте болельщика различные услуги: оплата транспортных расходов, входных билетов на домашние матчи, скидки и другие привилегии для держателей карты. Решение также может быть использовано в телекоммуникационной отрасли, ТЭК, госсекторе, на транспорте и т.д.","","",""));
				add(new Solution("244","","3424 dsfsdfdsf\ndfdsfsdf","cfgdg",""));
			}};
	}
}
